{
  "education": [
    {
      "awards_achievements": [
        "Sexton Scholar (2020)",
        "Dean's List (2021)"
      ],
      "degree": "Bachelor of Computer Science",
      "department": "Faculty Of Computer Science",
      "duration": "2019-2022",
      "school_name": "Dalhousie University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_BennyMugisha",
  "highlighted_projects": [
    {
      "description": "Implemented an interactive design that helps users navigate the app and find other users without difficulty. Utilized Electron as the main development provider of the cross-platform application.",
      "name": "Open Chat App"
    },
    {
      "description": "Analyzed machine learning statistics to predict the random crawler. Used Jupyter Notebook to write codes that will be presented as a double project.",
      "name": "Random Crawler and Projection"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Programmed a Linux Cluster Monitoring Agent resource to collect system and hardware specifications. Developed Bash Scripts to automate the installation of required docker containers and SQL running processes. Configured the Crontab to automate the collection of the Linux system resource usage. Followed the Software Development Life Cycle for GitFlow to track and modify my development of the scripts.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": "Integrated the database configuration for PostgreSQL to set up the initial exercise practice. Designed and tested a database using an ERD from an exercise about building data for club members, bookings, and facilities. Provided solutions to questions about database management and queries by following the PostgreSQL documentation.",
      "git_url": "/sql",
      "name": "RDBMS and SQL"
    }
  ],
  "name": "Benny Mugisha",
  "others": [
    {
      "bullets": [
        "IBM Applied DevOps Engineering Professional Certificate (2023)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Broader Reach Award - AYC Sailing School"
      ],
      "title": "Awards"
    },
    {
      "bullets": [
        "Workout fitness",
        "Board games",
        "Volleyball",
        "Traveling and Exploring New Places"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Organized my schedule to adjust to deadlines and daily scrum meetings. Performed the tasks using the notion project management platform to record the progress for the assigned modules. ",
      "duration": "2024-present",
      "title": "Software Developer"
    },
    {
      "company": "Vanderlande",
      "description": "Designed and implemented REST APIs to improve data exchange between systems to apply communication from front-end to back-end services. Utilized TypeScript, Angular, and Node.js to create user-friendly interfaces. Built scalable and high-performance applications using NoSQL databases. Attended Scrum meetings every day to provide updates on daily reports and discuss project deliverables assigned on Jira.",
      "duration": "Jan 2023 - Apr 2023",
      "title": "Software Developer Intern"
    },
    {
      "company": "Dalhousie University",
      "description": "Helped students with inquiries on academic work and course programs including assignments and projects. Guided students through specific, complex subjects to promote confidence in their knowledge.",
      "duration": "May 2022 - Dec 2022",
      "title": "FCS Learning Centre Staff"
    },
    {
      "company": "Manulife/TargetCW",
      "description": "Followed procedures for customer verification and communication flow. Handled inbound calls and correspondences from business customers. Checked the client's information and financial payment information for confirmation and correction.",
      "duration": "Jan 2018 - May 2022",
      "title": "Customer Service Representative"
    }
  ],
  "skills": {
    "competent": [
      "Angular",
      "React",
      "JavaScript",
      "NodeJS",
      "PHP",
      "Azure",
      "GCP"
    ],
    "familiar": [
      "Rust",
      "C",
      "C#",
      ".NET",
      "AWS",
      "Kubernetes"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git",
      "Docker",
      "C++",
      "Python"
    ]
  },
  "summary": "As a Software Developer, I have gained experience in programming and testing through education and hands-on roles. My Software Developer Internship allowed me to work with Java, SpringBoot, Angular, Azure, and MongoDB while developing key skills in communication and time management. I collaborated effectively with team members, listened to feedback, and managed multiple tasks to meet deadlines. My involvement in sports and societies during my Computer Science studies at Dalhousie University further enhanced my organizational skills and teamwork abilities. I am committed to continuous learning and eager to stay updated on industry advancements, always looking for new opportunities to grow and apply my skills."
}
